model = ['Тролза-5265.02 «Мегаполис»', 'БКМ 321', 'ВЗТМ-5284.02', 'Тролза-5265.08 «Мегаполис»',
                 'ВМЗ-5298.01 «Авангард»', 'ВЗТМ-5284', 'БКМ 32100С', 'ВМЗ-52981', 'БКМ 433030 Vitovt Max II',
                 'ВМЗ-5298-20', 'ВМЗ-5298-23-01', 'Тролза-62052.02 [62052В]', 'ВМЗ-62151 «Премьер»', 'ЗиУ-683БМ1',
                 'ВМЗ-5298-22', 'МТрЗ-6223-0000010', 'ВМЗ-5298.01 (ВМЗ-463)', 'ВМЗ-6215', 'Тролза-5265.00 «Мегаполис»',
                 'ПКТС-6281.00 «Адмирал»', 'БТЗ-52768Т', 'БКМ 32100D', 'ПТЗ-5283', 'ВМЗ-5298-020',
                 'Тролза-5275.03 «Оптима»', 'ВМЗ-5298-20-01', 'Тролза-6206.01 «Мегаполис»', 'ВМЗ-5298.00 (ВМЗ-375)']
print(len(model))
md = [BooleanVar() *]
md1.set(True)
mod1 = Checkbutton(window, text='Парк 6', var=p6)
p6c.grid(column=0, row=5)

for i in range(len(model)):
    print("md"+str(i)+' = BooleanVar()')
    print("md"+str(i)+'.set(True)')
    print("mod"+str(i)+" = Checkbutton(window, text='"+model[i]+"', var=md"+str(i)+')')
    print()