model = ['Тролза-5265.02 «Мегаполис»', 'БКМ 321', 'ВЗТМ-5284.02', 'Тролза-5265.08 «Мегаполис»',
                 'ВМЗ-5298.01 «Авангард»', 'ВЗТМ-5284', 'БКМ 32100С', 'ВМЗ-52981', 'БКМ 433030 Vitovt Max II',
                 'ВМЗ-5298-20', 'ВМЗ-5298-23-01', 'Тролза-62052.02 [62052В]', 'ВМЗ-62151 «Премьер»', 'ЗиУ-683БМ1',
                 'ВМЗ-5298-22', 'МТрЗ-6223-0000010', 'ВМЗ-5298.01 (ВМЗ-463)', 'ВМЗ-6215', 'Тролза-5265.00 «Мегаполис»',
                 'ПКТС-6281.00 «Адмирал»', 'БТЗ-52768Т', 'БКМ 32100D', 'ПТЗ-5283', 'ВМЗ-5298-020',
                 'Тролза-5275.03 «Оптима»', 'ВМЗ-5298-20-01', 'Тролза-6206.01 «Мегаполис»', 'ВМЗ-5298.00 (ВМЗ-375)']
model_garm_old = ['Тролза-62052.02 [62052В]', 'ЗиУ-683БМ1', 'ВМЗ-6215']
model_garm_new = ['БКМ 433030 Vitovt Max II', 'ВМЗ-62151 «Премьер»', 'Тролза-6206.01 «Мегаполис»']
model_garm = model_garm_new + model_garm_old
model_5298 = ["ВМЗ-52981", 'ВМЗ-5298-20', 'ВМЗ-5298-23-01', 'ВМЗ-5298-22', 'ВМЗ-5298-020', 'ВМЗ-5298-20-01', 'ВМЗ-5298.00 (ВМЗ-375)']
model_puzo = ["ВЗТМ-5284.02", 'ВЗТМ-5284']
model_old_wo_5298 = ['МТрЗ-6223-0000010', 'БТЗ-52768Т', 'ПТЗ-5283', 'Тролза-5275.03 «Оптима»'] + model_puzo +model_garm_old
model_old = model_old_wo_5298 + model_5298
model_rare = model_old + model_garm_new
model_megapolis = ['Тролза-5265.02 «Мегаполис»', 'Тролза-5265.08 «Мегаполис»', 'Тролза-5265.00 «Мегаполис»', 'Тролза-6206.01 «Мегаполис»']
model_avangard = ['ВМЗ-5298.01 «Авангард»', 'ВМЗ-62151 «Премьер»']
model_463 = ['ВМЗ-5298.01 (ВМЗ-463)']
model_admiral = ['ПКТС-6281.00 «Адмирал»']
model_bkm = ['БКМ 321', 'БКМ 32100С', 'БКМ 433030 Vitovt Max II']
model_highfloor = model_megapolis + model_avangard + model_463 + model_admiral +model_bkm